---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainText
source: html/410a02cb-754d-89eb-3ff2-62b481369c6f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainText Property

"Main Text"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldMainText { get; }
```